<a href="https://colab.research.google.com/github/Lounes-Kheris/IA-projects/blob/main/credit_predict.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#importer les package

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import pickle

#lire la base de données

df = pd.read_csv('/content/train_u6lujuX_CVtuZ9i.csv')
pd.set_option('display.max_rows', 10)
df

      Loan_ID  Gender Married  ... Credit_History Property_Area Loan_Status
0    LP001002    Male      No  ...            1.0         Urban           Y
1    LP001003    Male     Yes  ...            1.0         Rural           N
2    LP001005    Male     Yes  ...            1.0         Urban           Y
3    LP001006    Male     Yes  ...            1.0         Urban           Y
4    LP001008    Male      No  ...            1.0         Urban           Y
..        ...     ...     ...  ...            ...           ...         ...
609  LP002978  Female      No  ...            1.0         Rural           Y
610  LP002979    Male     Yes  ...            1.0         Rural           Y
611  LP002983    Male     Yes  ...            1.0         Urban           Y
612  LP002984    Male     Yes  ...            1.0         Urban           Y
613  LP002990  Female      No  ...            0.0     Semiurban           N

[614 rows x 13 columns]

In [ ]:
#voir les valeurs manquantes
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            614 non-null    object
 1   Gender             601 non-null    object
 2   Married            611 non-null    object
 3   Dependents         599 non-null    object
 4   Education          614 non-null    object
 5   Self_Employed      582 non-null    object
 6   ApplicantIncome    614 non-null    int64
 7   CoapplicantIncome  614 non-null    float64
 8   LoanAmount         592 non-null    float64
 9   Loan_Amount_Term   600 non-null    float64
 10  Credit_History     564 non-null    float64
 11  Property_Area      614 non-null    object
 12  Loan_Status        614 non-null    object
dtypes: float64(4), int64(1), object(8)
memory usage: 62.5+ KB

In [ ]:
df.isnull().sum().sort_values(ascending=False)

Credit_History       50
Self_Employed        32
LoanAmount           22
Dependents           15
Loan_Amount_Term     14
                     ..
Property_Area         0
CoapplicantIncome     0
ApplicantIncome       0
Education             0
Loan_ID               0
Length: 13, dtype: int64

In [ ]:
df.dtypes

Loan_ID              object
Gender               object
Married              object
Dependents           object
Education            object
                     ...
LoanAmount          float64
Loan_Amount_Term    float64
Credit_History      float64
Property_Area        object
Loan_Status          object
Length: 13, dtype: object

In [ ]:
df.describe(include='O')

         Loan_ID Gender Married  ... Self_Employed Property_Area Loan_Status
count        614    601     611  ...           582           614         614
unique       614      2       2  ...             2             3           2
top     LP002194   Male     Yes  ...            No     Semiurban           Y
freq           1    489     398  ...           500           233         422

[4 rows x 8 columns]

In [ ]:
#renseigner les valeurs manquantes
cat_data=[]
num_data=[]

for i,c in enumerate(df.dtypes):
  if c == object:
    cat_data.append(df.iloc[:,i])
  else:
    num_data.append(df.iloc[:,i])

cat_data=pd.DataFrame(cat_data).transpose()
num_data=pd.DataFrame(num_data).transpose()
num_data

     ApplicantIncome  CoapplicantIncome  ...  Loan_Amount_Term  Credit_History
0             5849.0                0.0  ...             360.0             1.0
1             4583.0             1508.0  ...             360.0             1.0
2             3000.0                0.0  ...             360.0             1.0
3             2583.0             2358.0  ...             360.0             1.0
4             6000.0                0.0  ...             360.0             1.0
..               ...                ...  ...               ...             ...
609           2900.0                0.0  ...             360.0             1.0
610           4106.0                0.0  ...             180.0             1.0
611           8072.0              240.0  ...             360.0             1.0
612           7583.0                0.0  ...             360.0             1.0
613           4583.0                0.0  ...             360.0             0.0

[614 rows x 5 columns]

In [ ]:
#pour les variable catégoriques, on va remplacer les val manquantes par les valeurs qui se repetent le plus
cat_data=cat_data.apply(lambda)